{
  "status": 200,
  "message": "Success",
  "results": [
    {
      "name": "Azure Best Practices",
      "description": "Returns secure, production-grade Azure best practices. Call this before generating Azure SDK code.",
      "command": "bestpractices"
    },
    {
      "name": "Azure Extension Commands",
      "description": "Extension commands for additional Azure tooling functionality. Includes operations for executing Azure CLI (az),\r\nAzure Developer CLI (azd), and Azure Quick Review (azqr) commands directly from the MCP server to extend\r\ncapabilities beyond native Azure service operations.",
      "command": "extension"
    },
    {
      "name": "Azure Resource Group Operations",
      "description": "Resource group operations - Commands for listing and managing Azure resource groups in your subscriptions.\r\nIncludes operations for listing clusters, retrieving cluster configurations, and managing Kubernetes environments\r\nin Azure.",
      "command": "group"
    },
    {
      "name": "Azure Subscription Operations",
      "description": "Azure subscription operations - Commands for managing Azure App Configuration stores and key-value settings.\r\nIncludes operations for listing configuration stores, managing key-value pairs, setting labels, locking/unlocking\r\nsettings, and retrieving configuration data.",
      "command": "subscription"
    },
    {
      "name": "Azure Kubernetes Service Operations",
      "description": "Azure Kubernetes Service operations - Commands for managing Azure Kubernetes Service (AKS) cluster resources.",
      "command": "aks"
    },
    {
      "name": "Azure App Configuration Operations",
      "description": "App Configuration operations - Commands for managing Azure App Configuration stores and key-value settings.",
      "command": "appconfig"
    },
    {
      "name": "Azure Role-Based Access Control Operations",
      "description": "Authorization operations - Commands for managing Azure Role-Based Access Control (RBAC) resources. Includes\r\noperations for listing role assignments, managing permissions, and working with Azure security and access\r\nmanagement at various scopes.",
      "command": "role"
    },
    {
      "name": "Azure Datadog Operations",
      "description": "Datadog operations - Commands for managing and monitoring Azure resources through Datadog integration. Includes\r\noperations for listing Datadog monitors and retrieving information about monitored Azure resources and their\r\nhealth status.",
      "command": "datadog"
    },
    {
      "name": "Azure Cosmos DB Operations",
      "description": "Cosmos DB operations - Cosmos DB operations - Commands for managing and querying Azure Cosmos DB resources. Includes operations for databases, containers, and document queries.",
      "command": "cosmos"
    },
    {
      "name": "Azure Foundry Operations",
      "description": "Foundry service operations - Commands for listing and managing services and resources in AI Foundry.",
      "command": "foundry"
    },
    {
      "name": "Azure Managed Grafana Operations",
      "description": "Grafana workspace operations - Commands for managing and accessing Azure Managed Grafana resources and monitoring\r\ndashboards. Includes operations for listing Grafana workspaces and managing data visualization and monitoring\r\ncapabilities.",
      "command": "grafana"
    },
    {
      "name": "Azure Key Vault Operations",
      "description": "Key Vault operations - Commands for managing and accessing Azure Key Vault resources.",
      "command": "keyvault"
    },
    {
      "name": "Azure Data Explorer Operations",
      "description": "Kusto operations - Commands for managing and querying Azure Data Explorer (Kusto) resources. Includes operations\r\nfor listing clusters and databases, executing KQL queries, retrieving table schemas, and working with Kusto data\r\nanalytics workloads.",
      "command": "kusto"
    },
    {
      "name": "Azure Marketplace Operations",
      "description": "Marketplace operations - Commands for managing and accessing Azure Marketplace products and offers.",
      "command": "marketplace"
    },
    {
      "name": "Azure Monitor Operations",
      "description": "Azure Monitor operations - Commands for querying and analyzing Azure Monitor logs and metrics.",
      "command": "monitor"
    },
    {
      "name": "Azure PostgreSQL Operations",
      "description": "PostgreSQL operations - Commands for managing Azure Database for PostgreSQL Flexible Server resources. Includes\r\noperations for listing servers and databases, executing SQL queries, managing table schemas, and configuring\r\nserver parameters.",
      "command": "postgres"
    },
    {
      "name": "Azure Redis Cache Operations",
      "description": "Redis Cache operations - Commands for managing Azure Redis Cache and Azure Managed Redis resources. Includes\r\noperations for listing cache instances, managing clusters and databases, configuring access policies, and working\r\nwith both traditional Redis Cache and Managed Redis services.",
      "command": "redis"
    },
    {
      "name": "Azure Search Operations",
      "description": "Search operations - Commands for managing Azure AI Search services and indexes. Includes operations for listing\r\nsearch services, managing search indexes, querying indexed data, and describing index schemas and configurations.",
      "command": "search"
    },
    {
      "name": "Azure Service Bus Operations",
      "description": "Service Bus operations - Commands for managing Azure Service Bus resources including queues, topics, and\r\nsubscriptions. Includes operations for managing message queues, topic subscriptions, and retrieving details about\r\nService Bus entities.",
      "command": "servicebus"
    },
    {
      "name": "Azure SQL Operations",
      "description": "Azure SQL operations - Commands for managing Azure SQL databases, servers, and elastic pools. Includes operations\r\nfor listing databases, configuring server settings, managing firewall rules, Entra ID administrators, and elastic\r\npool resources.",
      "command": "sql"
    },
    {
      "name": "Azure Storage Operations",
      "description": "Storage operations - Commands for managing and accessing Azure Storage resources. Includes operations for\r\ncontainers, blobs, and tables.",
      "command": "storage"
    },
    {
      "name": "Azure Workbooks Operations",
      "description": "Workbooks operations - Commands for managing Azure Workbooks resources and interactive data visualization\r\ndashboards. Includes operations for listing, creating, updating, and deleting workbooks, as well as managing\r\nworkbook configurations and content.",
      "command": "workbooks"
    },
    {
      "name": "Azure Bicep Schema Operations",
      "description": "Bicep schema operations - Commands for working with Azure Bicep Infrastructure as Code (IaC) generation and schema\r\nmanagement. Includes operations for retrieving Bicep schemas, templates, and resource definitions to support\r\ninfrastructure deployment automation.",
      "command": "bicepschema"
    },
    {
      "name": "Azure Virtual Desktop Operations",
      "description": "Virtual Desktop operations - Commands for managing and accessing Azure Virtual Desktop resources. Includes\r\noperations for hostpools, session hosts, and user sessions.",
      "command": "virtualdesktop"
    },
    {
      "name": "Azure Terraform Best Practices",
      "description": "Terraform best practices - Returns Terraform best practices for Azure. Call this before generating Terraform code for Azure Providers.",
      "command": "azureterraformbestpractices"
    },
    {
      "name": "Azure Load Testing Operations",
      "description": "Load Testing operations - Commands for managing Azure Load Testing resources, test configurations, and test runs.\r\nIncludes operations for creating and managing load test resources, configuring test scripts, executing performance\r\ntests, and monitoring test results.",
      "command": "loadtesting"
    }
  ]
}